{
  "tabs":[
    {
      "id":"100days",
      "name":"First 100 Days",
      "icon":"clock-o",
      "sections":[
        {
          "header":"Contract with the American Voter - 100 Day Plan",
          "link":"http://www.npr.org/2016/11/09/501451368/here-is-what-donald-trump-wants-to-do-in-his-first-100-days",
          "points":[
            {
              "text":"Propose a Constitutional Amendment to impose term limits on all members of Congress;",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Institute a hiring freeze on all federal employees to reduce federal workforce through attrition (exempting military, public safety, and public health);",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"A requirement that for every new federal regulation, two existing regulations must be eliminated;",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"A 5 year-ban on White House and Congressional officials becoming lobbyists after they leave government service;",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"A lifetime ban on White House officials lobbying on behalf of a foreign government;",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"A complete ban on foreign lobbyists raising money for American elections.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"On the same day, I will begin taking the following 7 actions to protect American workers:",
          "link":"http://www.npr.org/2016/11/09/501451368/here-is-what-donald-trump-wants-to-do-in-his-first-100-days",
          "points":[
            {
              "text":"I will announce my intention to renegotiate NAFTA or withdraw from the deal under Article 2205",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"I will announce our withdrawal from the Trans-Pacific Partnership",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"I will direct my Secretary of the Treasury to label China a currency manipulator",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"I will direct the Secretary of Commerce and U.S. Trade Representative to identify all foreign trading abuses that unfairly impact American workers and direct them to use every tool under American and international law to end those abuses immediately",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"I will lift the restrictions on the production of $50 trillion dollars' worth of job-producing American energy reserves, including shale, oil, natural gas and clean coal.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Lift the Obama-Clinton roadblocks and allow vital energy infrastructure projects, like the Keystone Pipeline, to move forward",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Cancel billions in payments to U.N. climate change programs and use the money to fix America's water and environmental infrastructure",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Additionally, on the first day, I will take the following five actions to restore security and the constitutional rule of law:",
          "link":"http://www.npr.org/2016/11/09/501451368/here-is-what-donald-trump-wants-to-do-in-his-first-100-days",
          "points":[
            {
              "text":"Cancel every unconstitutional executive action, memorandum and order issued by President Obama",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Begin the process of selecting a replacement for Justice Scalia from one of the 20 judges on my list, who will uphold and defend the Constitution of the United States",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Cancel all federal funding to Sanctuary Cities",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Begin removing the more than 2 million criminal illegal immigrants from the country and cancel visas to foreign countries that won't take them back",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Suspend immigration from terror-prone regions where vetting cannot safely occur. All vetting of people coming into our country will be considered extreme vetting.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Next, I will work with Congress to introduce the following broader legislative measures and fight for their passage within the first 100 days of my Administration:",
          "link":"http://www.npr.org/2016/11/09/501451368/here-is-what-donald-trump-wants-to-do-in-his-first-100-days",
          "points":[
            {
              "text":"Middle Class Tax Relief And Simplification Act. An economic plan designed to grow the economy 4% per year and create at least 25 million new jobs through massive tax reduction and simplification, in combination with trade reform, regulatory relief, and lifting the restrictions on American energy. The largest tax reductions are for the middle class. A middle-class family with 2 children will get a 35% tax cut. The current number of brackets will be reduced from 7 to 3, and tax forms will likewise be greatly simplified. The business rate will be lowered from 35 to 15 percent, and the trillions of dollars of American corporate money overseas can now be brought back at a 10 percent rate.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"End The Offshoring Act. Establishes tariffs to discourage companies from laying off their workers in order to relocate in other countries and ship their products back to the U.S. tax-free.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"American Energy & Infrastructure Act. Leverages public-private partnerships, and private investments through tax incentives, to spur $1 trillion in infrastructure investment over 10 years. It is revenue neutral.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"School Choice And Education Opportunity Act. Redirects education dollars to give parents the right to send their kid to the public, private, charter, magnet, religious or home school of their choice. Ends common core, brings education supervision to local communities. It expands vocational and technical education, and make 2 and 4-year college more affordable.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Repeal and Replace Obamacare Act. Fully repeals Obamacare and replaces it with Health Savings Accounts, the ability to purchase health insurance across state lines, and lets states manage Medicaid funds. Reforms will also include cutting the red tape at the FDA: there are over 4,000 drugs awaiting approval, and we especially want to speed the approval of life-saving medications.",
              "status":"notStarted",
              "comments":"https://www.reddit.com/r/trumptracker/comments/5c518s/i_will_ask_congress_to_convene_a_special_session/",
              "source":null
            },
            {
              "text":"Affordable Childcare and Eldercare Act. Allows Americans to deduct childcare and elder care from their taxes, incentivizes employers to provide on-side childcare services, and creates tax-free Dependent Care Savings Accounts for both young and elderly dependents, with matching contributions for low-income families.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"End Illegal Immigration Act Fully-funds the construction of a wall on our southern border with the full understanding that the country Mexico will be reimbursing the United States for the full cost of such wall; establishes a 2-year mandatory minimum federal prison sentence for illegally re-entering the U.S. after a previous deportation, and a 5-year mandatory minimum for illegally re-entering for those with felony convictions, multiple misdemeanor convictions or two or more prior deportations; also reforms visa rules to enhance penalties for overstaying and to ensure open jobs are offered to American workers first.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Restoring Community Safety Act. Reduces surging crime, drugs and violence by creating a Task Force On Violent Crime and increasing funding for programs that train and assist local police; increases resources for federal law enforcement agencies and federal prosecutors to dismantle criminal gangs and put violent offenders behind bars.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Restoring National Security Act. Rebuilds our military by eliminating the defense sequester and expanding military investment; provides Veterans with the ability to receive public VA treatment or attend the private doctor of their choice; protects our vital infrastructure from cyber-attack; establishes new screening procedures for immigration to ensure those who are admitted to our country support our people and our values",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Clean up Corruption in Washington Act. Enacts new ethics reforms to Drain the Swamp and reduce the corrupting influence of special interests on our politics.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"culture",
      "name":"Culture",
      "icon":"music",
      "sections":[
        {
          "header":"Trump",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"\"If I become president, we're all going to be saying 'Merry Christmas' again.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Never take a vacation while serving as president.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Start winning again. \"We're going to win so much -- win after win after win -- that you're going to be begging me: 'Please, Mr. President, let us lose once or twice. We can't stand it any more.' And I'm going to say: 'No way. We're going to keep winning. We're never going to lose. We're never, ever going to lose.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Bring back the American Dream.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Be a cheerleader for America and bring the country's spirit back. \"Take the brand of the United States and make it great again.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Make America great again -- and strong again, as it has become too weak.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Say things that are politically incorrect, because the country does not have time to waste with political correctness.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"I will take care of women, and I have great respect for women. I do cherish women, and I will take care of women.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Frequently use the term \"radical Islamic terrorism.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Prosecute Hillary Clinton for her use of a private e-mail server while serving as secretary of state.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Shut down parts of the internet",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Be unpredictable. \"No one is going to touch us, because I'm so unpredictable.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Students at Wofford College in South Carolina, where Trump attended a town hall, will all have jobs at graduation.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Lock her up.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Drop that \"dirty, rotten traitor\" Bowe Bergdahl out of an airplane into desolate Afghanistan without a parachute.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Ensure that Americans can still afford to golf.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"economy",
      "name":"Economy",
      "icon":"dollar",
      "sections":[
        {
          "header":"Minimum Wage",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"\"Against raising the minimum wage. Jobs would move to China.\" Wages should be raised through economic growth. Raise the minimum wage. Let's make it $10 dollars an hour. It should go up, but states should call the shots here.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Get rid of the federal minimum wage, leave it to the states.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Raise it to $10 an hour, ignore what I said before.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Taxes",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"The wealthy should pay more.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Cut taxes for the wealthy big time.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Maybe don't slash taxes by $10 trillion — slash taxes by $3 trillion, instead. Maybe ditch, maybe keep a $1 trillion tax cut for small businesses (depending on who is asking).",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Scrap the earlier plan entirely. Here are new tax brackets: Trump took his earlier tax plan offline before a major economic policy address in early August, where he hiked his initially proposed tax brackets from 10 percent, 20 percent and 25 percent to 12 percent, 25 percent and 33 percent. These brackets more closely mimic his party's past views on taxes.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Despite Trump's frequent talk about helping working people, his tax plan so far seems to mostly benefit the wealthy. It's unclear whether or not his plan will include that small business tax cut.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"National Debt",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Get rid of the national debt in 8 years.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Only pay down a little. Invest in infrastructure first.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Pay off the debt by getting America's creditors to accept less.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Either \"chop\" the national debt using an approach that is still unclear, or add $10 trillion to the debt to accomplish plans.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Assorted Numbers",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"Grow the nation's economy by at least 6 percent.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Reduce the $18 trillion national debt by \"vigorously eliminating waste, fraud and abuse in the federal government, ending redundant government programs and growing the economy to increase tax revenues.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Cut the budget by 20 percent by simply renegotiating.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Get rid of the Dodd-Frank Wall Street Reform and Consumer Protection Act.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Simplify the U.S. tax code and reduce the number of tax brackets from seven to four. The highest earners would pay a 25-percent tax. The corporate tax rate would fall to 15 percent. Eliminate the \"marriage penalty\" for taxpayers and get rid of the alternate minimum tax.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"No longer charge income tax to single individuals earning less than $25,000 per year or couples earning less than $50,000. These people will, however, be required to file a one-page form with the Internal Revenue Service that states: \"I win.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Allow corporations a one-time window to transfer money being held overseas, charging a much-reduced 10 percent tax.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Get rid of most corporate tax loopholes or incentives, but continue to allow taxpayers to deduct mortgage interest and charitable donations from their taxes.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"On his first day in office, Trump would get rid of gun-free zones at military bases and in schools.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Use \"common sense\" to fix the mental health system and prevent mass shootings. Find ways to arm more of the \"good guys\" like him who can take out the \"sickos.\" Get rid of bans on certain types of guns and magazines so that \"good, honest people\" can own the guns of their choice.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Impose a minimum sentence of five years in federal prison for any violent felon who commits a crime using a gun, with no chance for parole or early release.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Fix the background check system used when purchasing guns to ensure states are properly uploading criminal and health records.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Allow concealed-carry permits to be recognized in all 50 states.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Sign an executive order calling for the death penalty for anyone found guilty of killing a police officer.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Provide more funding for police training.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Provide more funding for drug treatment, especially for heroin addicts.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"On the first day in office, terminate President Obama's executive orders related to immigration. This includes getting rid of \"sanctuary cities\" that Trump says have become refuges for criminals.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Deport the almost 11 million immigrants illegally living in the United States.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Triple the number of U.S. Immigration and Customs Enforcement officers.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Continue to allow lowly paid foreign workers to come to the United States on temporary works visas because Trump says they are the only ones who want to pick grapes.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"environment",
      "name":"Environment",
      "icon":"leaf",
      "sections":[
        {
          "header":"Climate Change",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Global warming is real, but it's not man-made.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The Environmental Protection Agency might also disappear.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"government",
      "name":"Government",
      "icon":"university",
      "sections":[
        {
          "header":"Space Exploration",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"Stop spending money on space exploration until the United States can fix its potholes. Encourage private space-exploration companies to expand.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Legal",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"Pick Supreme Court justices who are \"really great legal scholars.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Assorted",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"Ensure that Iowa continues to host the nation's first presidential nominating contest.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Fire \"the corrupt and incompetent\" leaders of the U.S. Department of Veterans Affairs and dramatically reform the agency. Allow veterans to take their military identification card to any medical facility that accepts Medicaid patients to receive care. Embed satellite VA clinics in rural hospitals and underserved areas, and ensure than every VA hospital is permanently staffed with OBGYN doctors.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Invest more heavily in programs that help military veterans transition back to civilian life, including job training and placement services. Also increase funding for the treatment of post-traumatic stress disorder, traumatic brain injuries and mental health issues. Veterans who apply for a job at a VA facility will have five points added to their qualifying scores.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Replace \"free trade\" with \"fair trade.\" Gather together the \"smartest negotiators in the world,\" assign them each a country and renegotiate all foreign trade deals.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Tell Ford Motor Co.'s president that unless he cancels plans to build a massive plant in Mexico, the company will face a 35 percent tax on cars imported back into the United States. Trump is confident he can get this done before taking office. (Last year he incorrectly said this had already happened.)",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Force Nabisco to once again make Oreos in the United States. And bully Apple into making its \"damn computers\" and other products here.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Impose new taxes on many imports into the country. Numbers thrown around have included 32 percent, 34 percent and 35 percent.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"immigration",
      "name":"Immigration",
      "icon":"suitcase",
      "sections":[
        {
          "header":"Deportation",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Deport \"criminal illegal immigrants\" within one hour of being sworn in.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Deport all undocumented immigrants but bring the \"good\" ones back legally. In a CNN interview in July 2015, Trump said, \"I want to move them out, and we're going to move them back in and let them be legal, but they have to be in here legally.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Build the wall, deport criminals, triple the number of ICE officers, end birthright citizenship.  Get it done within 18 months. It’s an immensely complex endeavor, far harder than Trump’s simple sell, but now, if he doesn’t get it done, and doesn’t get our southern neighbor to pay for it, he’s failed.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Use a deportation force to implement policy.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Trump might be flexible on actually deporting 11 million undocumented immigrants. \"There's no amnesty\" but \"we work with them.\" \"I won't rule out a path to citizenship.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Deport all undocumented immigrants. Trump's campaign began with a promise to build a wall across the United States' southern border and deport the country's 11 million undocumented immigrants.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"The End Illegal Immigration act fully funds the construction of a wall on our southern border,\" Trump said on October 22nd, outlining the plans for his first 100 days in office. \"With the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such a wall, OK?\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Trump says he will deport millions, but he has not ruled out creating a pathway to citizenship. He'll build a wall, pay for said wall, but later he'll get reimbursed by Mexico.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Young Undocumented Immigrants and Children of Illegal Immigrants",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"\"Dreamers can maybe stay.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"End birthright citizenship.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Build the wall, deport criminals, triple the number of ICE officers, end birthright citizenship.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Build a wall, deport all undocumented immigrants. Trump's campaign began with a promise to build a wall across the United States' southern border and deport the country's 11 million undocumented immigrants.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Deport children benefiting for the DREAM Act and repeal the 14th Amendment to end birthright citizenship.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Visa's for High-Skilled Workers",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Against the H-1B visa program.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Border Control and the Refugee Crisis",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Against closing the borders entirely. Against accepting Syrian refugees in the United States. Bar Syrian refugees from entering the country and kick out any who are already living here. Trump says wealthy Persian Gulf nations like Saudi Arabia should pay to set up a heavily guarded \"safe zone\" in Syria.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Create a database of Syrian refugees. Trump hasn't ruled out creating a database of Muslims in the country.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"indigenouspeoples",
      "name":"Indigenous",
      "icon":"users",
      "sections":[
        {
          "header":"",
          "points":[

          ]
        }
      ]
    },
    {
      "id":"security",
      "name":"Security",
      "icon":"fighter-jet",
      "sections":[
        {
          "header":"Defeating Isis",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Declare war -- Send troops in. Definitely go after the oil fields. Destroy the oil. Let our regional allies send ground troops. If they don't, stop buying their oil. \"Do more with computers.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"It's still unclear what Trump's plan to defeat ISIS is, but it will involve computers and it will be tough. \"Bomb the s--- out of ISIS.\" Also bomb oil fields controlled by the Islamic State, then seize the oil and give the profits to military veterans who were wounded while fighting.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Allow Russia to deal with the Islamic State in Syria and/or work with Russian President Vladimir Putin to wipe out shared enemies.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Strengthen the military so that it's \"so big and so strong and so great\" that \"nobody's going to mess with us.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Target and kill the relatives of terrorists.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Shut down parts of the Internet so that Islamic State terrorists cannot use it to recruit American children.Find great generals -- like the next Gen. Patton or Gen. MacArthur -- and do not allow them to go onto television news shows to explain their military strategy: \"I don't want my generals being interviewed, I want my generals kicking a--.\" Trump likes generals who are rough, foul-mouthed and beloved by their troops.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Find great generals -- like the next Gen. Patton or Gen. MacArthur -- and do not allow them to go onto television news shows to explain their military strategy: \"I don't want my generals being interviewed, I want my generals kicking a--.\" Trump likes generals who are rough, foul-mouthed and beloved by their troops.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"'First Use' and Nuclear Arms",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"It's unclear where Trump stands on \"first use,\" or if he'd be willing to strike first.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Guns",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Get rid of gun-free zones.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"No guns in classrooms, except maybe some guns in classrooms. Let's put trained gunmen in schools.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"More guns would save lives.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"More guns are better, though the details are murky and evolving on how many gun-free zones would be abolished.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Torture",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"The military will obey potentially illegal orders.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The laws forbidding torture should be changed so no one has to break them.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Trump says he's against violating international laws or ordering others to do so, but wants to change the laws to legalize, at minimum, waterboarding. Trump has said he's willing to use interrogation techniques that go even further than waterboarding. Even if such tactics don't work, \"they deserve it anyway, for what they're doing.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"health",
      "name":"Health",
      "icon":"heart",
      "sections":[
        {
          "header":"Abortion",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Overturn Roe v. Wade, then let states decide it.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Defund Planned Parenthood.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Health Care",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"Repeal Obamacare. Replace it with something.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Knock down the regulatory walls between states for health insurance, making plans available nationally instead of regionally.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Save Medicare, Medicaid and Social Security without cutting benefits.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Make medical marijuana widely available to patients, and allow states to decide if they want to fully legalize pot or not.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"internationalpolicy",
      "name":"International",
      "icon":"globe",
      "sections":[
        {
          "header":"Israel",
          "link":"http://www.jewishpress.com/news/breaking-news/complete-list-of-the-trump-campaigns-promises-to-israel/2016/11/09/",
          "points":[
            {
              "text":"The unbreakable bond between the United States and Israel is based upon shared values of democracy, freedom of speech, respect for minorities, cherishing life, and the opportunity for all citizens to pursue their dreams.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Israel is the state of the Jewish people, who have lived in that land for 3,500 years. The State of Israel was founded with courage and determination by great men and women against enormous odds and is an inspiration to people everywhere who value freedom and human dignity.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Israel is a staunch ally of the U.S. and a key partner in the global war against Islamic jihadism. Military cooperation and coordination between Israel and the U.S. must continue to grow.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The American people value our close friendship and alliance with Israel — culturally, religiously, and politically. While other nations have required U.S. troops to defend them, Israelis have always defended their own country by themselves and only ask for military equipment assistance and diplomatic support to do so. The U.S. does not need to nation-build in Israel or send troops to defend Israel.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The Memorandum of Understanding signed by the American and Israeli Governments is a good first step, but there is much more to be done. A Trump Administration will ensure that Israel receives maximum military, strategic and tactical cooperation from the United States, and the MOU will not limit the support that we give. Further, Congress will not be limited to give support greater than that provided by the MOU if it chooses to do so. Israel and the United States benefit tremendously from what each country brings to the table — the relationship is a two way street.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The U.S. should veto any United Nations votes that unfairly single out Israel and will work in international institutions and forums, including in our relations with the European Union, to oppose efforts to delegitimize Israel, impose discriminatory double standards against Israel, or to impose special labeling requirements on Israeli products or boycotts on Israeli goods.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The U.S. should cut off funds for the UN Human Rights Council, a body dominated by countries presently run by dictatorships that seems solely devoted to slandering the Jewish State. UNESCO’s attempt to disconnect the State of Israel from Jerusalem is a one-sided attempt to ignore Israel’s 3,000-year bond to its capital city, and is further evidence of the enormous anti-Israel bias of the United Nations.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The U.S. should view the effort to boycott, divest from, and sanction (BDS) Israel as inherently anti-Semitic and take strong measures, both diplomatic and legislative, to thwart actions that are intended to limit commercial relations with Israel, or persons or entities doing business in Israeli areas, in a discriminatory manner. The BDS movement is just another attempt by the Palestinians to avoid having to commit to a peaceful co-existence with Israel. The false notion that Israel is an occupier should be rejected.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The Trump administration will ask the Justice Department to investigate coordinated attempts on college campuses to intimidate students who support Israel.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"A two-state solution between Israel and the Palestinians appears impossible as long as the Palestinians are unwilling to renounce violence against Israel or recognize Israel’s right to exist as a Jewish state. Additionally, the Palestinians are divided between PA rule in the West Bank and Hamas rule in Gaza so there is not a united Palestinian people who could control a second state. Hamas is a US-designated terrorist organization that actively seeks Israel’s destruction. We will seek to assist the Israelis and the Palestinians in reaching a comprehensive and lasting peace, to be freely and fairly negotiated between those living in the region.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The Palestinian leadership, including the PA, has undermined any chance for peace with Israel by raising generations of Palestinian children on an educational program of hatred of Israel and Jews. The larger Palestinian society is regularly taught such hatred on Palestinian television, in the Palestinian press, in entertainment media, and in political and religious communications. The two major Palestinian political parties — Hamas and Fatah — regularly promote anti-Semitism and jihad.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The U.S. cannot support the creation of a new state where terrorism is financially incentivized, terrorists are celebrated by political parties and government institutions, and the corrupt diversion of foreign aid is rampant. The U.S. should not support the creation of a state that forbids the presence of Christian or Jewish citizens, or that discriminates against people on the basis of religion.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The U.S. should support direct negotiations between Israel and the Palestinians without preconditions, and will oppose all Palestinian, European and other efforts to bypass direct negotiations between parties in favor of an imposed settlement. Any solutions imposed on Israel by outside parties including by the United Nations Security Council, should be opposed. We support Israel’s right and obligation to defend itself against terror attacks upon its people and against alternative forms of warfare being waged upon it legally, economically, culturally, and otherwise.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Israel’s maintenance of defensible borders that preserve peace and promote stability in the region is a necessity. Pressure should not be put on Israel to withdraw to borders that make attacks and conflict more likely.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The U.S. will recognize Jerusalem as the eternal and indivisible capital of the Jewish state and Mr. Trump’s Administration will move the U.S. embassy to Jerusalem.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Despite the Iran Nuclear deal in 2015, the U.S. State Department recently designated Iran, yet again, as the leading state sponsor of terrorism — putting the Middle East particularly, but the whole world at risk by financing, arming, and training terrorist groups operating around the world including Hamas, Hezbollah, and forces loyal to Syrian President Bashar al-Assad. The U.S. must counteract Iran’s ongoing violations of the Joint Comprehensive Plan of Action regarding Iran’s quest for nuclear weapons and their noncompliance with past and present sanctions, as well as the agreements they signed, and implement tough, new sanctions when needed to protect the world and Iran’s neighbors from its continuing nuclear and non-nuclear threats.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Proposed Muslim Ban",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"No Muslims should be allowed to enter the United States —as immigrants or visitors. Ban Muslims from entering but make an exception for friends and Muslims serving in the US military. Ban Muslims as a matter of policy, as well as people from countries with a history of terrorism.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"The ban would call for \"extreme vetting.\" There's a ban, plus \"extreme vetting\" that includes an ideological test.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Only people who love America are allowed. Temporarily ban most foreign Muslims from entering the United States \"until our country's representatives can figure out what is going on.\" Trump would allow exceptions for dignitaries, business people, athletes and others who have \"proven\" themselves.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Trump will not say whether or not he intends to ban people of Muslim faith from the U.S., but he will say that \"extreme vetting\" will apply to people from certain countries. It's unclear where those countries are, what \"extreme vetting\" entails or how he intends to institute an ideological test for entry.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Heavily surveil mosques in the United States. Trump has said he's open to the idea of closing some mosques.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Voting for the Iraq War",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"It doesn't matter, people make mistakes.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"It's OK that Trump's running mate voted for the Iraq war, but it's not OK that Clinton did.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"2011 Intervention in Libya",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"The intervention in Libya by the U.S.-led coalition was a terrible idea.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"I wanted a surgical intervention, not a \"strong\" intervention.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"We really should have taken the oil in Libya, too, since we were there.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"As Trump put it, \"I was for something, but I wasn't for what we have right now.\" That \"something\" seems to include violating the Geneva Conventions to seize Libyan oil.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Japan",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Japan should have nuclear weapons.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"I never said that!\"It's unclear whether Trump would reverse U.S. policy to allow Japan to have nuclear weapons, but it's clear Trump doesn't like being reminded of the previous positions he took.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"It's unclear whether Trump would reverse U.S. policy to allow Japan to have nuclear weapons, but it's clear Trump doesn't like being reminded of the previous positions he took.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Iran",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Renegotiate the Iran Nuclear Deal.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"I promise I will never be in a bicycle race. That I can tell you.\" (This promise is connected to criticism of Secretary of State John F. Kerry, who was injured while riding a bicycle amid the Iran negotiations.)",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Refuse to call Iran's leader by his preferred title. \"I guarantee you I will be never calling him the Supreme Leader... I'll say, 'Hey baby, how ya doing?' I will never call him the Supreme Leader.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Negotiate the release of all U.S. prisoners held in Iran before taking office. (Five hostages were recently released, including Washington Post reporter Jason Rezaian; Trump has taken some credit for this.)",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"Afghanistan",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Leave troops in Afghanistan because it's such \"a mess.\" Protect Israel. And increase U.S. military presence in the East and South China Seas.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Find an \"out\" clause in the Iran deal and then \"totally\" renegotiate the whole thing.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        },
        {
          "header":"China",
          "link":"http://www.nbcnews.com/politics/2016-election/full-list-donald-trump-s-rapidly-changing-policy-positions-n547801",
          "points":[
            {
              "text":"Aggressively challenge China's power in the world by declaring the country a currency manipulator, adopting a \"zero tolerance policy on intellectual property theft and forced technology transfer\" and cracking down on China's \"lax labor and environmental standards.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Rather than throw the Chinese president a state dinner, buy him \"a McDonald's hamburger and say we've got to get down to work.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Put billionaire hedge fund manager Carl Icahn in charge of trade negotiations with China and Japan, and pick an ambassador to Japan who is \"a killer,\" unlike the current ambassador, Caroline Kennedy.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"education",
      "name":"Education",
      "icon":"graduation-cap",
      "sections":[
        {
          "header":"Common Core",
          "link":"https://www.washingtonpost.com/news/post-politics/wp/2016/01/22/here-are-76-of-donald-trumps-many-campaign-promises/",
          "points":[
            {
              "text":"Get rid of Common Core because it's \"a disaster\" and a \"very bad thing.\" Trump says he wants to give local school districts more control and might even eliminate the Department of Education.",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    },
    {
      "id":"unsorted",
      "name":"Unsorted",
      "icon":"pencil-square-o",
      "sections":[
        {
          "header":"Categorization Needed",
          "link":"http://www.nydailynews.com/news/politics/donald-trump-big-list-promises-article-1.2865483",
          "points":[
            {
              "text":"Donald Trump: It's time to heal this divided nation",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Shred or rework trade agreements with Mexico, China and many other countries — and if companies leave for overseas, hit them with huge tariffs.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Deport, deport, deport — if not en masse, through a federal deportation force, at least expulsions in numbers far greater than the records President Obama already set.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Dismantle Obamacare, which has eliminated discrimination based on preexisting conditions, given 20 million additional Americans health insurance and, though you wouldn’t know it, bent the overall cost curve. What does it get replaced with? “Something terrific,” TBD.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Pass a huge tax cut, roughly double the one George W. Bush sponsored, that delivers a windfall to the wealthiest Americans and a relative paltry sum to the middle class, never mind the debt-inflating impact.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Ensure that “the crime and violence that today afflicts our nation will soon come to an end” — a pledge made in his nomination acceptance speech — by restoring law and order. Revive inner cities that he says have become hell holes.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Bring back jobs, especially manufacturing jobs, that have fled the country over the past few decades.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Impose tariffs on goods made in China and Mexico",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Renegotiate or withdraw from the North American Free Trade Agreement and Trans-Pacific Partnership",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Leave Social Security as is",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Cut taxes",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"End the war on coal.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Meet with Homeland Security officials and generals to begin securing the southern border.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Notify all countries that refuse to take back dangerous illegal immigrants who have committed crimes in this country that they will lose access to our visa programs if they continue to do so.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Convene his top generals and inform them they have 30 days to come up with a plan to stop ISIS.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Call the heads of major companies who are moving operations oversea to inform them that they'll face 35 percent tariffs.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Contact countries and say…'Folks, we love protecting you, we want to continue to protect you but you're not living up to the bargain'…They're not paying what they're supposed to be paying—which is very little, by the way.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Defend the unborn.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Withdraw from TPP.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Start taking care of our military.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Suspend Syrian refugee resettlement.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Notify our NAFTA partners of my intention to renegotiate the deal.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Direct every agency in government to begin identifying all wasteful job-killing regulations, and they are going to be removed.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Get rid of gun-free zones [in] schools\" and \"military bases\"—which would require repealing a 25-year-old federal law. (\"My first day, it gets signed, okay? My first day. There's no more gun-free zones.\")",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Ask Congress to pass 'Kate's Law'—named for Kate Steinle—to ensure that criminal aliens convicted of illegal reentry receive strong mandatory minimum sentences.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Learn the difference between Hezbollah and Hamas.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Tackle the gun lobby to try to reduce the outrageous number of people who are dying from gun violence in our country.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Reach out to Republicans and say, 'This is your chance to help millions of families and show that your party, the party of Lincoln, is better than Donald Trump.'\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"\"Work with both parties to pass the biggest investment in new, good-paying jobs since World War II.\"",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"He has pledged to repeal the Affordable Care Act.",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Grow the DFP by at least 6%",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Get rid of most corporate tax loopholes",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Get rid of income tax for some earners",
              "status":"notStarted",
              "comments":null,
              "source":null
            },
            {
              "text":"Allow concealed carry permits to be recognized in all 50 states",
              "status":"notStarted",
              "comments":null,
              "source":null
            }
          ]
        }
      ]
    }
  ]
}
